# 1
alphabet = {' ': '-...-', 'а':'.-', 'б':'-...', 'в':'.--', 'г':'--.', 'д':'-..', 'е':'.', 'ё':'.', 'ж':'...-', 'з':'--.', 'и':'..', 'й':'.---', 'к':'-.-', 'л':'.-..', 'м':'--', 'н':'-.', 'о':'---', 'п':'.--.', 'р':'.-.', 'с':'...', 'т':'-', 'у':'..-', 'ф':'..-.', 'х':'....', 'ц':'-.-.', 'ч':'---.', 'ш':'----', 'щ':'--.-', 'ъ':'--.--', 'ы':'-.--', 'ь':'-..-', 'э':'..-..', 'ю':'..--', 'я':'.-.-'
           }

trs = input().lower()
N_word = [alphabet[i] for i in trs]
print(*N_word)

# 2
alphabet = {' ': '-...-', 'а':'.-', 'б':'-...', 'в':'.--', 'г':'--.', 'д':'-..', 'е':'.','ж':'...-', 'з':'--.', 'и':'..', 'й':'.---', 'к':'-.-', 'л':'.-..', 'м':'--', 'н':'-.', 'о':'---', 'п':'.--.', 'р':'.-.', 'с':'...', 'т':'-', 'у':'..-', 'ф':'..-.', 'х':'....', 'ц':'-.-.', 'ч':'---.', 'ш':'----', 'щ':'--.-', 'ъ':'--.--', 'ы':'-.--', 'ь':'-..-', 'э':'..-..', 'ю':'..--', 'я':'.-.-'
           }


decryption = input().split()
answer = [[x for x, y in alphabet.items() if y == i] for i in decryption]
ans = ''.join([i[0] for i in answer])
print(ans)

# 3
lst = input().split()
d = dict()
answer = [d.setdefault(i) for i in lst]
print(*d.keys())

# 4
# import sys // не забудьте написать эту строку

# считывание списка из входного потока
lst_in = list(map(str.strip, sys.stdin.readlines()))

# здесь продолжайте программу (используйте список lst_in)
d = dict()
for x in lst_in:
    d.setdefault(x.split()[0], []).append(x.split()[1])

for x, y in d.items():
    print(f"{x}: {', '.join(y)}")

# 5
N = int(input()) * 1000
things = {'карандаш': 20, 'зеркальце': 100, 'зонт': 500, 'рубашка': 300,
          'брюки': 1000, 'бумага': 200, 'молоток': 600, 'пила': 400, 'удочка': 1200,
          'расческа': 40, 'котелок': 820, 'палатка': 5240, 'брезент': 2130, 'спички': 10}
things = dict(sorted(things.items(), key=lambda item: item[1], reverse=1) )
ans = [x for x, y in things.items() if N >= y and (N := N - y) >= 0]
print(*ans)
